IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/WDT2_WDT2.xml
<module name="WDT2_WDT2" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="WDT2_RTIGCTRL" acronym="WDT2_RTIGCTRL" offset="0x0" width="32" description="">
		<bitfield id="RESERVED2" width="12" begin="31" end="20" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 20" rwaccess="RW"/> 
		<bitfield id="NTUSEL" width="4" begin="19" end="16" resetval="0x0" description="NTUSEL: Select NTU signal.These bits determine which NTU input signal is used as external timebase. There are up to four inputs supported with four valid selection combinations. Any invalid selection value written to the NTUSEL bit-field will result in a TIED LOW being used as the NTU signal. The NTU signal will also be TIED LOW in case of a single-bit flip as it will result in an invalid combination of NTUSEL.User and privilege mode (read):0000 = NTU00101 = NTU11010 = NTU21111 = NTU3other = tied to ?0?Privilege mode (write):0000 = NTU00101 = NTU11010 = NTU21111 = NTU3other = tied to ?0?" range="19 - 16" rwaccess="RW"/> 
		<bitfield id="COS" width="1" begin="15" end="15" resetval="0x0" description="COS: Continue On Suspend.This bit determines if both counters are stopped when the device goes into debug mode or if they continue counting.User and privilege mode (read):0 = counters are stopped while in debug mode1 = counters are running while in debug modePrivilege mode (write):0 = stop counters in debug mode1 = continue counting in debug mode" range="15" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="13" begin="14" end="2" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="14 - 2" rwaccess="RW"/> 
		<bitfield id="CNT1EN" width="1" begin="1" end="1" resetval="0x0" description="CNT1EN: Counter 1 Enable. The CNT1EN bit starts and stops the operation of counter block 1 (UC1 and FRC1).User and privilege mode (read):0 = counters are stopped1 = counters are runningPrivilege mode (write):0 = stop counters1 = start countersGives the absolute 32 bit destination address (physical)." range="1" rwaccess="RW"/> 
		<bitfield id="CNT0EN" width="1" begin="0" end="0" resetval="0x0" description="CNT0EN: Counter 0 Enable.The CNT0EN bit starts and stops the operation of counter block 0 (UC0 and FRC0).User and privilege mode (read):0 = counters are stopped1 = counters are runningPrivilege mode (write):0 = stop counters1 = start countersGives the absolute 32 bits source address (physical)." range="0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTITBCTRL" acronym="WDT2_RTITBCTRL" offset="0x4" width="32" description="">
		<bitfield id="INC" width="1" begin="1" end="1" resetval="0x0" description="INC: Increment Free Running Counter 0.This bit determines wether the Free Running Counter 0 is automatically incremented if a failing clock on the NTUx signal is detected.User and privilege mode (read):0 = FRC0 will not be incremented1 = FRC0 will be incrementedPrivilege mode (write):0 = Do not increment FRC0 on failing external clock1 = Increment FRC0 on failing external clock" range="1" rwaccess="RW"/> 
		<bitfield id="TBEXT" width="1" begin="0" end="0" resetval="0x0" description="TBEXT: Timebase External.The Timebase External bit selects whether the Free Running Counter 0 is clocked by the internal Up Counter 0 or from the external signal NTUx. Since setting the TBEXT bit to 1 resets Up Counter 0, Free Running Counter 0 will not be incremented in this occurence. The only source which is able to increment Free Running Counter 0 is NTUx.When the Timebase Supervisor circuit detects a missing clockedge, then the TBEXT bit is reset.The selection if the external signal should be used, can only be done by software.User and privilege mode (read):0 = UC0 clocks FRC01 = NTUx clocks FRC0Privilege mode (write):0 = MUX is switched to internal UC0 clocking scheme1 = MUX is switched to external NTUx clocking scheme" range="0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTICAPCTRL" acronym="WDT2_RTICAPCTRL" offset="0x8" width="32" description="">
		<bitfield id="RESERVED4" width="30" begin="31" end="2" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 2" rwaccess="RW"/> 
		<bitfield id="CAPCNTR1" width="1" begin="1" end="1" resetval="0x0" description="CAPCNTR1: Capture Counter 1.This bit determines, which external interrupt source triggers a capture event of both UC1 and FRC1.User and privilege mode (read):0 = capture event is triggered by Capture Event Source 01 = capture event is triggered by Capture Event Source 1Privilege mode (write):0 = enable capture event triggered by Capture Event Source 01 = enable capture event triggered by Capture Event Source 1" range="1" rwaccess="RW"/> 
		<bitfield id="CAPCNTR0" width="1" begin="0" end="0" resetval="0x0" description="CAPCNTR0: Capture Counter 0.This bit determines, which external interrupt source triggers a capture event of both UC0 and FRC0.User and privilege mode (read):0 = capture event is triggered by Capture Event Source 01 = capture event is triggered by Capture Event Source 1Privilege mode (write):0 = enable capture event triggered by Capture Event Source 01 = enable capture event triggered by Capture Event Source 111 indexed10 reserved01 post-increment00 constant" range="0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTICOMPCTRL" acronym="WDT2_RTICOMPCTRL" offset="0xC" width="32" description="">
		<bitfield id="RESERVED8" width="19" begin="31" end="13" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 13" rwaccess="RW"/> 
		<bitfield id="COMP3SEL" width="1" begin="12" end="12" resetval="0x0" description="COMPSEL3: Compare Select 3.This bit determines the counter with which the compare value hold in compare register 3 is compared.User and privilege mode (read):0 = value will be compared with FRC 01 = value will be compared with FRC 1Privilege mode (write):0 = enable compare with FRC 01 = enable compare with FRC 1" range="12" rwaccess="RW"/> 
		<bitfield id="RESERVED7" width="3" begin="11" end="9" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="11 - 9" rwaccess="RW"/> 
		<bitfield id="COMP2SEL" width="1" begin="8" end="8" resetval="0x0" description="COMPSEL2: Compare Select 2.This bit determines the counter with which the compare value hold in compare register 2 is compared.User and privilege mode (read):0 = value will be compared with FRC 01 = value will be compared with FRC 1Privilege mode (write):0 = enable compare with FRC 01 = enable compare with FRC 1" range="8" rwaccess="RW"/> 
		<bitfield id="RESERVED6" width="3" begin="7" end="5" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="7 - 5" rwaccess="RW"/> 
		<bitfield id="COMP1SEL" width="1" begin="4" end="4" resetval="0x0" description="COMPSEL1: Compare Select 1.This bit determines the counter with which the compare value hold in compare register 1 is compared. User and privilege mode (read):0 = value will be compared with FRC 01 = value will be compared with FRC 1Privilege mode (write):0 = enable compare with FRC 01 = enable compare with FRC 1" range="4" rwaccess="RW"/> 
		<bitfield id="RESERVED5" width="3" begin="3" end="1" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="3 - 1" rwaccess="RW"/> 
		<bitfield id="COMP0SEL" width="1" begin="0" end="0" resetval="0x0" description="COMPSEL0: Compare Select 0.This bit determines the counter with which the compare value hold in compare register 0 is compared.User and privilege mode (read):0 = value will be compared with FRC 01 = value will be compared with FRC 1Privilege mode (write):0 = enable compare with FRC 01 = enable compare with FRC 1" range="0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTIFRC0" acronym="WDT2_RTIFRC0" offset="0x10" width="32" description="">
		<bitfield id="FRC0" width="32" begin="31" end="0" resetval="0x0" description="FRC0: Free Running Counter 0.This registers holds the current value of the Free Running Counter 0 and will be updated continuously.User and privilege mode (read):current value of the counterPrivilege mode (write):The counter can be preset by writing to this register. The counter increments then from this written value upwards.Note: Presetting countersIf counters have to be preset, they have to be stopped from counting in the RTIGCTRL register in order to ensure consistency between RTIUC0 and RTIFRC0." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTIUC0" acronym="WDT2_RTIUC0" offset="0x14" width="32" description="">
		<bitfield id="UC0" width="32" begin="31" end="0" resetval="0x0" description="UC0: Up Counter 0.This registers holds the current value of the Up Counter 0 and prescales the RTI clock. It will be only updated by a previous read of Free Running Counter 0. This gives effectively a 64 bit read of both counters, without having the problem of a counter being updated between two consecutive reads on Up Counter 0 and Free Running Counter 0.User and privilege mode (read):value of the counter when the Free Running Counter 0 was readPrivilege mode (write):the counter can be preset by writing to this register. The counter increments then from this written value upwards.Note: Presetting countersIf counters have to be preset, they have to be stopped from counting in the RTIGCTRL register in order to ensure consistency between RTIUC0 and RTIFRC0.Note: Preset value concernIf the preset value is bigger than the compare value stored in register RTICPUC0 then it can take a long time until a compare matches, since RTIUC0 has to count up until it overflows." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTICPUC0" acronym="WDT2_RTICPUC0" offset="0x18" width="32" description="">
		<bitfield id="CPUC0" width="32" begin="31" end="0" resetval="0x0" description="This registers holds the compare value, which is compared with the Up Counter 0. When the compare matches, Free Running counter 0 is incremented. The Up Counter is set to zero when the counter value matches the CPUC0 value. The value set in this prescales the RTI clock.If CPUC0 = 0: then, frequency = RTICLK/ (2^32)If CPUC0 ? 0: then , frequency = RTICLK/(CPUC0 + 1)User and privilege mode (read):current compare valuePrivilege mode (write when TBEXT = 0):the compare value is updatedPrivilege mode (write when TBEXT = 1):the compare value is not changed" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTICAFRC0" acronym="WDT2_RTICAFRC0" offset="0x20" width="32" description="">
		<bitfield id="CAFRC0" width="32" begin="31" end="0" resetval="0x0" description="CAFRC0: Capture Free Running Counter 0.This registers captures the current value of the Free Running Counter 0 when a event occurs, controlled by the external capture control block.User and privilege mode (read):value of Free Running Counter 0 on a capture event" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTICAUC0" acronym="WDT2_RTICAUC0" offset="0x24" width="32" description="">
		<bitfield id="CAUC0" width="32" begin="31" end="0" resetval="0x0" description="CAUC0: Capture Up Counter 0.This registers captures the current value of the Up Counter 0 when a event occurs, controlled by the external capture control block. The read sequence has to be the same as with Up Counter 0 and Free Running Counter 0. So the RTICAFRC0 register has to be read first, before the RTICAUC0 register is read. This sequence ensures that the value of the RTICAUC0 register is the corresponding value to the RTICAFRC0 register, even if another capture event happens in between the two reads.User and privilege mode (read):value of Up Counter 0 on a capture event" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTIFRC1" acronym="WDT2_RTIFRC1" offset="0x30" width="32" description="">
		<bitfield id="FRC1" width="32" begin="31" end="0" resetval="0x0" description="FRC1: Free Running Counter 1.This registers holds the current value of the Free Running Counter 1 and will be updated continuously.User and privilege mode (read):current value of the counterPrivilege mode (write):The counter can be preset by writing to this register. The counter increments then from this written value upwards.Note: Presetting countersIf counters have to be preset, they have to be stopped from counting in the RTIGCTRL register in order to ensure consistency between RTIUC1 and RTIFRC1." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTIUC1" acronym="WDT2_RTIUC1" offset="0x34" width="32" description="">
		<bitfield id="UC1" width="32" begin="31" end="0" resetval="0x0" description="UC1: Up Counter 1.This registers holds the current value of the Up Counter 1 and prescales the RTI clock. It will be only updated by a previous read of Free Running Counter 1. This gives effectively a 64 bit read of both counters, without having the problem of a counter being updated between two consecutive reads on Up Counter 1 and Free Running Counter 1.User and privilege mode (read):value of the counter when the Free Running Counter 1 was readPrivilege mode (write):the counter can be preset by writing to this register. The counter increments then from this written value upwards.Note: Presetting countersIf counters have to be preset, they have to be stopped from counting in the RTIGCTRL register in order to ensure consistency between RTIUC1 and RTIFRC1.Note: Preset value concernIf the preset value is bigger than the compare value stored in register RTICPUC1 then it can take a long time until a compare matches, since RTIUC1 has to count up until it overflows." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTICPUC1" acronym="WDT2_RTICPUC1" offset="0x38" width="32" description="">
		<bitfield id="CPUC1" width="32" begin="31" end="0" resetval="0x0" description="This registers holds the compare value, which is compared with the Up Counter 1. When the compare matches, Free Running Counter 1 is incremented. The Up Counter is set to zero when the counter value matches the CPUC1 value. The value set in this prescales the RTI clock.If CPUC1 = 0: then, frequency = RTICLK/ (2^32)If CPUC1 ? 0: then , frequency = RTICLK/(CPUC1 + 1)User and privilege mode (read):current compare valuePrivilege mode (write when TBEXT = 0):the compare value is updatedPrivilege mode (write when TBEXT = 1):the compare value is not changed" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTICAFRC1" acronym="WDT2_RTICAFRC1" offset="0x40" width="32" description="">
		<bitfield id="CAFRC1" width="32" begin="31" end="0" resetval="0x0" description="CAFRC1: Capture Free Running Counter 1.This registers captures the current value of the Free Running Counter 1 when a event occurs, controlled by the external capture control block.User and privilege mode (read):value of Free Running Counter 1 on a capture event" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTICAUC1" acronym="WDT2_RTICAUC1" offset="0x44" width="32" description="">
		<bitfield id="CAUC1" width="32" begin="31" end="0" resetval="0x0" description="CAUC1: Capture Up Counter 1.This registers captures the current value of the Up Counter 1 when a event occurs, controlled by the external capture control block. The read sequence has to be the same as with Up Counter 1 and Free Running Counter 1. So the RTICAFRC1 register has to be read first, before the RTICAUC1 register is read. This sequence ensures that the value of the RTICAUC1 register is the corresponding value to the RTICAFRC1 register, even if another capture event happens in between the two reads.User and privilege mode (read):value of Up Counter 1 on a capture event" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTICOMP0" acronym="WDT2_RTICOMP0" offset="0x50" width="32" description="">
		<bitfield id="COMP0" width="32" begin="31" end="0" resetval="0x0" description="COMP0: Compare 0.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, an interrupt is flagged. With this register it is also possible to initiate a DMA request.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTIUDCP0" acronym="WDT2_RTIUDCP0" offset="0x54" width="32" description="">
		<bitfield id="UDCP0" width="32" begin="31" end="0" resetval="0x0" description="UDCP0: Update Compare 0 Register.This registers holds a value, which is added to the value in the compare 0 register each time a compare matches. This gives the possibility to generate periodic interrupts without software intervention.User and privilege mode (read):value to be added to the compare 0 register on the next compare matchPrivilege mode (write):new update value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTICOMP1" acronym="WDT2_RTICOMP1" offset="0x58" width="32" description="">
		<bitfield id="COMP1" width="32" begin="31" end="0" resetval="0x0" description="COMP1: compare1.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, an interrupt is flagged. With this register it is also possible to initiate a DMA request.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTIUDCP1" acronym="WDT2_RTIUDCP1" offset="0x5C" width="32" description="">
		<bitfield id="UDCP1" width="32" begin="31" end="0" resetval="0x0" description="UDCP1: Update compare1 Register.This registers holds a value, which is added to the value in the compare1 register each time a compare matches. This gives the possibility to generate periodic interrupts without software intervention.User and privilege mode (read):value to be added to the compare1 register on the next compare matchPrivilege mode (write):new update value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTICOMP2" acronym="WDT2_RTICOMP2" offset="0x60" width="32" description="">
		<bitfield id="COMP2" width="32" begin="31" end="0" resetval="0x0" description="COMP2: compare 2.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, an interrupt is flagged. With this register it is also possible to initiate a DMA request.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="WDT2_RTIUDCP2" acronym="WDT2_RTIUDCP2" offset="0x64" width="32" description="">
		<bitfield id="UDCP2" width="32" begin="31" end="0" resetval="0x0" description="UDCP2: Update compare 2 Register.This registers holds a value, which is added to the value in the compare 2 register each time a compare matches. This gives the possibility to generate periodic interrupts without software intervention.User and privilege mode (read):value to be added to the compare 2 register on the next compare matchPrivilege mode (write):new update value" range="31 - 0" rwaccess="RW"/>
	</register>
